---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCLegacyStairOrRamp.GetLandingGeometries
source: html/2518b539-0cfd-ab03-173c-5e8a7949590d.htm
---
# Autodesk.Revit.DB.IFC.IFCLegacyStairOrRamp.GetLandingGeometries Method

Gets the geometries of landings.

## Syntax (C#)
```csharp
public IList<IList<GeometryObject>> GetLandingGeometries()
```

## Returns
The geometries of landings.